
## Terraform Comment

**Project:** terraform/mathews-recurring-revenue-stg

**Command:** plan

**Outcome:** success

<details>
  <summary>
    <b>Output: </b>
  </summary>

  <pre>google_service_account.dbt_project: Refreshing state... [id=projects/mathews-recurring-revenue-stg/serviceAccounts/dbt-project@mathews-recurring-revenue-stg.iam.gserviceaccount.com]
google_storage_bucket.dbt-project-bucket: Refreshing state... [id=mathews-recurring-revenue-stg-dbt-project-bucket]
google_bigquery_dataset.raw: Refreshing state... [id=projects/mathews-recurring-revenue-stg/datasets/raw]
google_project_iam_member.dbt_project["roles/bigquery.user"]: Refreshing state... [id=mathews-recurring-revenue-stg/roles/bigquery.user/serviceAccount:dbt-project@mathews-recurring-revenue-stg.iam.gserviceaccount.com]
google_project_iam_member.dbt_project["roles/bigquery.dataEditor"]: Refreshing state... [id=mathews-recurring-revenue-stg/roles/bigquery.dataEditor/serviceAccount:dbt-project@mathews-recurring-revenue-stg.iam.gserviceaccount.com]
google_bigquery_table.google_sheets__incomes: Refreshing state... [id=projects/mathews-recurring-revenue-stg/datasets/raw/tables/google_sheets__incomes]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.dbt-project will be created
  + resource "google_artifact_registry_repository" "dbt-project" {
      + create_time      = (known after apply)
      + description      = "dbt Project Artifact Registry Repository"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "us-central1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "mathews-recurring-revenue-stg"
      + registry_uri     = (known after apply)
      + repository_id    = "dbt-project"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-old-images"

          + condition {
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (2 unchanged attributes hidden)
            }
        }
      + cleanup_policies {
          + action = "KEEP"
          + id     = "keep-last-3-versions"

          + most_recent_versions {
              + keep_count            = 3
              + package_name_prefixes = []
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: mathews-recurring-revenue-stg

To perform exactly these actions, run the following command to apply:
    terraform apply "mathews-recurring-revenue-stg"
</pre>
</details>
